workspace/cases/synthetic_N5_step/slice0001/system/controlDict
FoamFile { format ascii; class dictionary; object controlDict; }
application pimpleFoam;
startFrom startTime;
startTime 0;
stopAt endTime;
endTime 0.20000000000000001;
deltaT 0.00020000000000000001;
writeControl adjustableRunTime;
writeInterval 0.01;
adjustTimeStep no;
writeFormat ascii;
functions
{
    adapter { type preciceAdapterFunctionObject; libs ("libpreciceAdapterFunctionObject.so"); }
    exampleDiagnostic { writeControl timeStep; writeInterval 5; }
}
