workspace/cases/synthetic_N5_step/slice0001/constant/momentumTransport
FoamFile { format ascii; class dictionary; object momentumTransport; }
simulationType laminar;
