workspace/cases/synthetic_N5_step/slice0001/system/preciceDict
FoamFile { format ascii; class dictionary; object preciceDict; }
preciceConfig "../precice-config.xml";
participant Fluid_0001;
modules (FSI);
FSI { solverType incompressible; rho rho [1 -3 0 0 0 0 0] 1000; namePointDisplacement pointDisplacement; nameCellDisplacement cellDisplacement; nameForce Force; }
interfaces { Interface1 { mesh Fluid-Mesh-slice_0001; patches (cylinder); locations faceCenters; readData (Displacement); writeData (Force); } }
